### 1) 상대경로 / 절대경로
### 2) 데이터셋 불러오기(pandas ~ csv ~ sep(seperater) 활용법 기억)-콤마로!
### 3) 데이터 불러올 경우 한글 유의

# 1.라이브러리 정의

In [2]:
import pandas as pd

# 2. 데이터 불러오기

In [ ]:
try:
    pd.read_csv(..)
except Exception as e:
    print(e):

In [15]:
pd.read_csv("../dataset/customerdata.csv")

     CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0    A13566  4273.900000    3            6    1.679181  Big-Screen-lover
1    A14219  3642.441950    2            4    2.682023      Sleeping-dog
2    A15312  3653.884565    2            5    3.208202      Sleeping-dog
3    A16605  3713.211107    2            6    0.900000        Early-bird
4    B10634  3391.074215    2            4    2.453656      Sleeping-dog
..      ...          ...  ...          ...         ...               ...
145  Z13253  3678.800000    2            5    2.463670  Big-Screen-lover
146  Z13534  3662.437527    3            6    0.900000        Early-bird
147  Z16428  3516.500000    2            5    2.371301  Big-Screen-lover
148  Z16735  3300.100000    2            5    1.704942  Big-Screen-lover
149  Z19835  3326.526183    2            6    1.200000        Early-bird

[150 rows x 6 columns]

# 3. 데이터 저장하기

In [62]:
carDataUrlPath = "https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv"

indata = pd.read_csv(carDataUrlPath)

type(indata) ##타입 확인하기 (타입=pandas 어찌구가 나옴)

indata.to_csv("./outdata.csv", index=False)

In [63]:
pd.read_csv("./outdata.csv")

     age  gender  miles   debt  income  sales
0     28       0     23      0    4099    620
1     26       0     27      0    2677   1792
2     30       1     58  41576    6215  27754
3     26       1     25  43172    7626  28256
4     20       1     17   6979    8071   4438
..   ...     ...    ...    ...     ...    ...
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104

[963 rows x 6 columns]

In [47]:
data = pd.read_csv("../dataset/kopo_region_mst_hangul.csv",
           encoding="ms949")

In [48]:
data

   REGIONID REGIONNAME
0       A00       아프리카
1       A01         미국
2       A02         한국
3       A03         독일
4       A04        브라질
..      ...        ...
68      A68      베네수엘라
69      A69        베트남
70      A70       바누아투
71      A71        NaN
72      A99         기타

[73 rows x 2 columns]

In [ ]:
## 데이터 컬럼바꾸기(재정의)

In [55]:
data.columns = ["SALESID", "REGIONNAME"]

In [56]:
data

   SALESID REGIONNAME
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질
..     ...        ...
68     A68      베네수엘라
69     A69        베트남
70     A70       바누아투
71     A71        NaN
72     A99         기타

[73 rows x 2 columns]

In [57]:
renameData = data.rename(columns={"SALESID":"SID",
                    "REGIONNAME":"SNAME"})

In [64]:
renameData

    SID  SNAME
0   A00   아프리카
1   A01     미국
2   A02     한국
3   A03     독일
4   A04    브라질
..  ...    ...
68  A68  베네수엘라
69  A69    베트남
70  A70   바누아투
71  A71    NaN
72  A99     기타

[73 rows x 2 columns]

# 1. 데이터 불러오기

In [68]:
targetData = "../dataset/kopo_product_volume.csv"

In [75]:
data = pd.read_csv(targetData, encoding="ms949")

# 2. 데이터변환(컬럼이름 소문자로 변경)

In [73]:
data.columns = ["regionid","productgroup","yearweek","volume"]

# 3. 데이터 저장(postgres에 저장)

In [76]:
import psycopg2

from sqlalchemy import create_engine ## sqlalchemy가 있는이유는 엔진을 만들기 위해서

In [77]:
##     engine = create_engine("postgresql://scott:tiger@localhost/test")
mylocalpgUrl = "postgresql://postgres:postgres@127.0.0.1/postgres"

In [79]:
engine_pg = create_engine(mylocalpgUrl)

In [130]:
resultTablename = "pg_out"

In [ ]:
## table명을 불러오는 것은 같다!!
pd.read_sql_table(table_name="pg_out", con=engine_pg)

In [ ]:
## if_exist? 동일한 이름의 데이터가 있을떄 대처 방법들
data.to_sql(name=resultTablename,
            con=mylocalpgUrl,
           if_exists="replace",
           index=False)

# 상대방의 데이터베이스 테이블 불러오기
# 1. 데이터 불러오기

In [103]:
import psycopg2

from sqlalchemy import create_engine

In [105]:
mylocalpgUrl = "postgresql://postgres:1234@192.168.110.24:5432/postgres"

In [107]:
engine = create_engine(mylocalpgUrl)

In [112]:
resultTable = "pg_out"

In [114]:
selloutData = pd.read_sql_query('select * from pg_out', engine)

# 2. 데이터 변환(컬럼명 변경하기)

In [121]:
selloutData.columns = ['region','productID','yearweekNum','value']
result = selloutData
result

    region productID  yearweekNum   value
0      A01    ST0001       201415  810144
1      A01    ST0002       201415  128999
2      A01    ST0001       201418  671464
3      A01    ST0002       201418  134467
4      A01    ST0001       201413  470040
..     ...       ...          ...     ...
260    A01    ST0002       201614  148835
261    A01    ST0001       201641  746061
262    A01    ST0002       201412  151750
263    A01    ST0001       201420  645626
264    A01    ST0002       201420  125863

[265 rows x 4 columns]

# 3. 데이터 저장하기

In [123]:
result.to_sql(name="pg_out_byhj", index=False, con=engine_pg)

In [ ]:
###